tests/wiremock/files/shopper-response-parentchild.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><snp:GetParentChildShopperByDomainName xmlns:snp="urn:RegDBWebSvcService"><ResultsXML>&lt;GetParentChildShopperByDomainName&gt;&lt;/GetParentChildShopperByDomainName&gt;</ResultsXML></snp:GetParentChildShopperByDomainName></soap:Body></soap:Envelope>